app/controllers/sessions_controller.rb

  def create
  	puts "NAME"
  	puts params[:session][:name]
    if @admin = Admin.find_by_name(params[:session][:name])
---
SELECT "admins".* FROM "admins" WHERE "admins"."name" = 'admin' LIMIT 1