app/controllers/users_controller.rb

INSERT INTO "users" ("accepted", "created_at", "dist", "distance", "email", "end", "foodtype", "going_out", "group_id", "has_pref", "matched", "name", "start", "timeEnd", "timeStart", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    # Validates unique on save


    if @user.save