app/controllers/venues_controller.rb

	def index
		@venue = Venue.find_by_id(1)
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = 1 LIMIT 1