app/controllers/venues_controller.rb

	def create
	@venue = Venue.new(params[:venue])
		if @venue.distString != 'Other'
	      if @venue.distString[2] == '5'
	        @venue.distance = 5
	      else
	        @venue.distance = 10
	      end
	  else
	      @venue.distance = 1000
	  end

    if @venue.save!
---
INSERT INTO "venues" ("created_at", "distString", "distance", "foodtype", "name", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def deleteVenue
		@venue = Venue.find_by_id(params[:id])
		@venue.destroy
---
SELECT "venues".* FROM "venues" WHERE "venues"."id" = 3 LIMIT 1
DELETE FROM "venues" WHERE "venues"."id" = ?  [["id", 3]]